In [1]:
import numpy as np
import pandas as pd
import pandasql as ps
from pandas import Series, DataFrame
import datetime as dt
import matplotlib.pyplot as plt
import sys
import time

In [1]:
from pathlib import Path
Path.cwd()

WindowsPath('C:/Users/balob/Documents/GITLAB/RB_BD')

## 1. Отчет по странам с небольшим или отрицательным профитом

In [1]:
import pyodbc 
#Connect to OCSDBREP1 (BSS)
cnxn = pyodbc.connect('DRIVER={SQL Server};SERVER=172.18.11.82;DATABASE=10028;UID=BSS;PWD=iKQVm40AZAmyRaw72LeY')

In [3]:
sql_srt=\
'''
--Calculate total charge and cost by MCC, MNC, usage_type, account_id
select CONVERT(VARCHAR(8), u.usage_date, 3) as 'REP_DATE'
,u.mcc,u.mnc,u.usage_type,uc.account_id
,sum(u.quantity) as quantity,sum(uc.charge) as charge,sum(uc.cost) as cost from [10028_usage2018-04].[dbo].[USAGE] u
inner join [10028_usage2018-04].[dbo].[USAGE_CHARGES] uc
on u.USAGE_ID = uc.USAGE_ID
group by CONVERT(VARCHAR(8), u.usage_date, 3),u.mcc,u.mnc,u.usage_type,uc.account_id
order by u.mcc,CONVERT(VARCHAR(8), u.usage_date, 3)
'''

In [4]:
df = pd.read_sql_query(sql_srt, cnxn,parse_dates={'REP_DATE': '%d/%m/%y'})
df.head()

    REP_DATE  mcc  mnc usage_type  account_id   quantity   charge     cost
0 2018-04-01  202    5         15    352321.0    4.05000  0.00000  0.00000
1 2018-04-01  202    5         15    352370.0  278.61663  0.00000  0.00000
2 2018-04-01  202    5         21    352321.0   18.00000  0.00000  0.00000
3 2018-04-01  202    5         21    352334.0   26.00000  0.00000  0.00000
4 2018-04-01  202    5         22    352334.0   63.00000  0.63945  0.37044

In [5]:
def f(x):
    data=x[['charge','cost']]
    x['profit']=data['charge']-data['cost']
    if data['cost']!=0:
        x['profit_per']=round((x['profit']/data['cost'])*100,1)
    else:
        x['profit_per']=0
    return x

df1=df.groupby(['mcc','mnc']).agg({'charge': np.sum, 'cost': np.sum}).apply(f,axis=1).copy()

In [6]:
df1[df1['profit']<0]

             charge         cost      profit  profit_per
mcc mnc
208 10      2.37834     34.06715   -31.68881       -93.0
    29    233.39442    274.69781   -41.30339       -15.0
214 9      24.09512    676.18343  -652.08831       -96.4
234 3       0.27545      0.91020    -0.63475       -69.7
240 10      0.07635      0.14915    -0.07280       -48.8
310 260    10.61740    677.87273  -667.25533       -98.4
    680  1465.88595   2125.99344  -660.10749       -31.0
515 2    6012.19448  10894.22103 -4882.02655       -44.8
901 18      0.74520      8.12001    -7.37481       -90.8

In [7]:
df2=df.groupby(['REP_DATE','mcc','mnc']).agg({'charge': np.sum, 'cost': np.sum}).apply(f,axis=1).copy()
df2.head()

                     charge     cost   profit  profit_per
REP_DATE   mcc mnc
2018-02-16 530 1    0.00026  0.00015  0.00011        73.3
2018-02-21 222 10   0.78593  0.45280  0.33313        73.6
2018-02-22 222 10   0.28601  0.16414  0.12187        74.2
2018-02-23 222 10   0.05382  0.02994  0.02388        79.8
2018-02-24 222 10   0.09339  0.05312  0.04027        75.8

In [9]:
df2[(df2.index.get_level_values('mcc')==310) & (df2.index.get_level_values('mnc')==680)].head()

                       charge       cost    profit  profit_per
REP_DATE   mcc mnc
2018-04-01 310 680   78.21434   72.55151   5.66283         7.8
2018-04-02 310 680   42.00338   53.25511 -11.25173       -21.1
2018-04-03 310 680   64.79633   61.03443   3.76190         6.2
2018-04-04 310 680  173.01345  144.49367  28.51978        19.7
2018-04-05 310 680   29.24078   47.55932 -18.31854       -38.5

## 2. Сравнительный анализ цен в TAP и Cost в OCS

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import pyodbc
import mysql.connector #pip install mysql-connector-python-rf
from os.path import join, normpath

In [2]:
# Задать переменные и загрузить вспомогательные данные

data_tariff_allowed = 0.6 # Тариф для data в USD, который рассматривается как discounter
tap_data_tot_charge_threshold = 100 # Полная цена по PLMN, ниже которой не анализируется разница в процентах между тарифами ТАР и OCS
tap_ocs_tariff_diff = 100 # Допустимая разница в процентах между тарифами ТАР и OCS

downloads = 'C:/Users/balob/Downloads'

df_al=pd.read_csv(join(downloads,'DMI.dmi_allowed_list_export_Tue_Feb_05_2019.csv'))

### Получение данных

In [3]:
#Из базы данных BSS выгружаем данные по тарифам

cnxn = mysql.connector.connect(user='noc', password='WcQUzkXiXwoxnFfGnRxb',host='172.18.11.40',database='BSS')

sql_srt=\
'''
SELECT
VisitedNetworkTadig AS TADIG
,CostTariffId AS Price_Plan
,MIN((Cost*1024*1024)/TotalChargedUnits) AS tap_data_min
,AVG((Cost*1024*1024)/TotalChargedUnits) AS tap_data_avg
,STDDEV_SAMP((Cost*1024*1024)/TotalChargedUnits) AS tap_data_std
,MAX((Cost*1024*1024)/TotalChargedUnits) AS tap_data_max
,SUM(Cost) AS tap_data_tot_charge
,SUM(Revenue) AS tap_data_tot_revenue
FROM TAP.GPRS_CALL
WHERE
TreatedTimestampUtc > 20190115000000
AND TotalChargedUnits > 1024
GROUP BY VisitedNetworkTadig,CostTariffId
'''

df_tap_tariff = pd.read_sql_query(sql_srt, cnxn)
cnxn.close()
df_tap_tariff.head()

,TADIG,Price_Plan,tap_data_min,tap_data_avg,tap_data_std,tap_data_max,tap_data_tot_charge,tap_data_tot_revenue
0,AIACW,Partner Cost Plan 2018,0.025399,0.025880,0.000760,0.029443,3.957752,7.915276
1,ALBVF,Partner Cost Plan 2018,0.000000,0.001831,0.001688,0.006185,56.312536,112.669829
2,ARGTM,Partner Cost Plan 2018,0.000000,0.018045,0.006882,0.047506,4818.538632,9408.893813
3,ARM01,Partner Cost Plan 2018,0.004972,0.005046,0.000112,0.005961,169.130413,338.240057
4,ATGCW,Partner Cost Plan 2018,0.000000,0.023879,0.001748,0.026323,365.055420,730.107006

In [4]:
#Из базы данных OCS выгружаем тарифы и объединяем с данными BSS и сохраняем в файл csv

import pandas as pd
import pyodbc 
#Connect to OCSDBREP1 (BSS)
cnxn = pyodbc.connect('DRIVER={SQL Server};SERVER=172.18.11.82;DATABASE=10028;UID=BSS;PWD=iKQVm40AZAmyRaw72LeY')

sql_srt=\
'''
SELECT t.tadig_code AS TADIG,p.roaming_plan_name  AS Price_Plan
,CASE WHEN rpr.currency_id=1 THEN rpr.mo_call_rate WHEN rpr.currency_id=2 THEN rpr.mo_call_rate*1.2 END ocs_moc_rate
,CASE WHEN rpr.currency_id=1 THEN rpr.mt_call_rate WHEN rpr.currency_id=2 THEN rpr.mt_call_rate*1.2 END ocs_mtc_rate
,CASE WHEN rpr.currency_id=1 THEN rpr.mo_sms_rate WHEN rpr.currency_id=2 THEN rpr.mo_sms_rate*1.2 END ocs_mo_sms_rate
,CASE WHEN rpr.currency_id=1 THEN rpr.mt_sms_rate WHEN rpr.currency_id=2 THEN rpr.mt_sms_rate*1.2 END ocs_mt_sms_rate
,CASE WHEN rpr.currency_id=1 THEN rpr.data_rate WHEN rpr.currency_id=2 THEN rpr.data_rate*1.2 END ocs_data_rate
,rpr.is_discounted
FROM ROAMING_PLAN_RULES rpr
LEFT JOIN RDB_TADIG_CODES t
ON rpr.network_id=t.network_id
LEFT JOIN ROAMING_PLANS p
ON rpr.roaming_plan_id=p.roaming_plan_id
WHERE rpr.roaming_plan_id IN (267,268)
AND rpr.end_date IS NULL
AND p.deleted IS NULL
'''

df_ocs_tariff = pd.read_sql_query(sql_srt, cnxn)
cnxn.close()

df = pd.merge(df_tap_tariff,df_ocs_tariff[['TADIG','Price_Plan','ocs_data_rate']],
        how='left',on=['TADIG','Price_Plan'])

df['pct_diff'] = (df['tap_data_avg'] - df['ocs_data_rate'])*100 / df['ocs_data_rate']

#df.to_csv('./DATA/tap_ocs_analysis_180817.csv',index=False)
df.head()

,TADIG,Price_Plan,tap_data_min,tap_data_avg,tap_data_std,tap_data_max,tap_data_tot_charge,tap_data_tot_revenue,ocs_data_rate,pct_diff
0,AIACW,Partner Cost Plan 2018,0.025399,0.025880,0.000760,0.029443,3.957752,7.915276,0.0257,0.699390
1,ALBVF,Partner Cost Plan 2018,0.000000,0.001831,0.001688,0.006185,56.312536,112.669829,0.0030,-38.963823
2,ARGTM,Partner Cost Plan 2018,0.000000,0.018045,0.006882,0.047506,4818.538632,9408.893813,0.0180,0.248790
3,ARM01,Partner Cost Plan 2018,0.004972,0.005046,0.000112,0.005961,169.130413,338.240057,0.0050,0.927172
4,ATGCW,Partner Cost Plan 2018,0.000000,0.023879,0.001748,0.026323,365.055420,730.107006,0.0240,-0.503739

### Анализ данных

In [13]:
#Для анализа можно загрузить уже имеющиеся данные

df = pd.read_csv('./DATA/tap_ocs_analysis_180817.csv')

In [5]:
# Находим тарифы TAP выше заданного допустимого уровня для данного типа тарифа

df[df.tap_data_avg > data_tariff_allowed].sort_values(by=['tap_data_avg'],ascending=False)

Empty DataFrame
Columns: [TADIG, Price_Plan, tap_data_min, tap_data_avg, tap_data_std, tap_data_max, tap_data_tot_charge, tap_data_tot_revenue, ocs_data_rate, pct_diff]
Index: []

In [6]:
# Находим тарифы с наибольшей разницей между данными ТАР и тарифами OCS

df[(df.tap_data_tot_charge > tap_data_tot_charge_threshold)&(df.pct_diff > tap_ocs_tariff_diff)]\
.sort_values(by=['pct_diff'],ascending=False)

Empty DataFrame
Columns: [TADIG, Price_Plan, tap_data_min, tap_data_avg, tap_data_std, tap_data_max, tap_data_tot_charge, tap_data_tot_revenue, ocs_data_rate, pct_diff]
Index: []

In [9]:
# Анализ данных по Allowed list в DMI и тарифов в OCS

tadig = 'AIACW'

display(df_ocs_tariff[df_ocs_tariff.TADIG == tadig])
display(df[df.TADIG == tadig])
display(df_al[(df_al['PLMN code'] == tadig) & (df_al['Sponsor'].str.contains('', na=False))])

,TADIG,Price_Plan,ocs_moc_rate,ocs_mtc_rate,ocs_mo_sms_rate,ocs_mt_sms_rate,ocs_data_rate,is_discounted
129,AIACW,P4 Cost Plan 2018,0.9600,0.0,0.0960,0.0,0.0960,True
354,AIACW,Partner Cost Plan 2018,0.1606,0.0,0.0128,0.0,0.0257,True

,TADIG,Price_Plan,tap_data_min,tap_data_avg,tap_data_std,tap_data_max,tap_data_tot_charge,tap_data_tot_revenue,ocs_data_rate,pct_diff
0,AIACW,Partner Cost Plan 2018,0.025399,0.02588,0.00076,0.029443,3.957752,7.915276,0.0257,0.69939

               Sponsor PLMN code  MO  MT  SMS  Data  MO.1  sec  Data.1   kb
122   Partner_mon_worl     AIACW   1   1    1     1     1    1     NaN  NaN
157     Partner_Maxcom     AIACW   1   1    1     1     1    1     NaN  NaN
160            Partner     AIACW   1   1    1     1     1    1     NaN  NaN
247   Partner_STI_Comb     AIACW   1   1    1     1     1    1     NaN  NaN
326     Partner_telzar     AIACW   1   1    1     1     1    1     NaN  NaN
519     Partner_mondic     AIACW   1   1    1     1     1    1     NaN  NaN
1106      Partner_2018     AIACW   1   1    1     1     1    1     NaN  NaN
1639        Partner_PS     AIACW   1   1    1     1     1    1     NaN  NaN
1782  Partner_Clay_Com     AIACW   1   1    1     1     1    1     NaN  NaN
2165    PA_Telzar_Soft     AIACW   1   1    1     1     1    1     NaN  NaN
2343  Partner_Combined     AIACW   1   1    1     1     1    1     NaN  NaN
2540  Partner_Dialoq_A     AIACW   1   1    1     1     1    1     NaN  NaN
2679       Partner_All     AIACW   1   1    1     1     1    1     NaN  NaN
2951  Partner_WMB_Comb     AIACW   1   1    1     1     1    1     NaN  NaN
3101  Partner_RedT_Sof     AIACW   1   1    1     1     1    1     NaN  NaN

In [8]:
df_al[(df_al['PLMN code'].str.startswith('PRI', na=False)) & (df_al['Sponsor'].str.contains('Partner', na=False))]

Empty DataFrame
Columns: [Sponsor, PLMN code, MO, MT, SMS, Data, MO.1, sec, Data.1,  kb]
Index: []

In [23]:
#Анализ данных из BSS по заданному тарифу

cnxn = mysql.connector.connect(user='noc', password='WcQUzkXiXwoxnFfGnRxb',host='172.18.11.40',database='BSS')

sql_srt=\
'''
SELECT
VisitedNetworkTadig
,Cost
,CostTariffId
,TotalChargedUnits
,(Cost*1024*1024)/TotalChargedUnits AS Price
,GprsDest_accessPointNameNI
,InTapFileName
,OutTapFileName
FROM TAP.GPRS_CALL
WHERE
TreatedTimestampUtc > 20190201000000
AND VisitedNetworkTadig = 'ITAOM' AND Cost > 0
AND CostTariffId LIKE 'Partner%'
LIMIT 300
'''

df_tap = pd.read_sql_query(sql_srt, cnxn)
cnxn.close()
df_tap.head()

,VisitedNetworkTadig,Cost,CostTariffId,TotalChargedUnits,Price,GprsDest_accessPointNameNI,OutTapFileName
0,ITAOM,0.031910,Partner Cost Plan 2018,11209156,0.002985,globaldata,cloud9tap/incoming/CDITAOMRMBFI09098
1,ITAOM,0.030522,Partner Cost Plan 2018,10615987,0.003015,globaldata,cloud9tap/incoming/CDITAOMRMBFI09098
2,ITAOM,0.008324,Partner Cost Plan 2018,2734210,0.003192,globaldata,cloud9tap/incoming/CDITAOMRMBFI09098
3,ITAOM,0.076305,Partner Cost Plan 2018,26493880,0.003020,globaldata,cloud9tap/incoming/CDITAOMRMBFI09098
4,ITAOM,0.029135,Partner Cost Plan 2018,10421898,0.002931,chili,nakatap/incoming/CDITAOMNAKAM01922

# Тестирование

#### Парсинг TAP файлов

In [ ]:
from pandas import DataFrame
from bs4 import BeautifulSoup
tap_file = open(join(downloads,'CPVTM.txt')).read()
#tap_file = open(join(downloads,'TAP.txt')).read()
soup = BeautifulSoup(tap_file, 'xml')
print(soup.find('sender').text,soup.find('localCurrency').text,soup.find('exchangeRate').text)
for callEventDetails in soup.find_all('callEventDetails'):
    print(callEventDetails.imsi.text,
          callEventDetails.charge.text,
          callEventDetails.chargeableUnits.text)